[
  {
    "id": 3,
    "name": "Lucali",
    "project_info": "A Gourmet Restaurant Website",
    "image": "./projectimg/preview-3.png",
    "short_detail": "Lucali: A global gourmet restaurant website serving flavors from around the world. Frontend powered by Next.js app-router, RTK Query, and Axios. Backend built with Prisma, PostgreSQL, TypeScript, and Express for a seamless and delightful culinary experience. Bon appétit!",
    "detail": "Lucali Gourmet Restaurant offers a global culinary adventure with an intuitive and stylish frontend, backed by a robust backend. The frontend, designed using Next.js, TypeScript, Tailwind CSS, and DaisyUI, ensures a visually appealing and user-friendly experience. Menu exploration, food details with customer ratings, and the ability to leave reviews and make reservations are some key features. Custom authentication based on access tokens is available for login and signup. The backend is built with Prisma, PostgreSQL, Express, and TypeScript, ensuring data integrity and security. It features various API routes for user management, reservations, authentication, menu items, and customer reviews, making Lucali a comprehensive dining destination.",
    "slide1": "./projectimg/luc1.png",
    "slide2": "./projectimg/luc2.png",
    "slide3": "./projectimg/luc3.png",
    "slide4": "./projectimg/luc4.png",
    "slide5": "./projectimg/luc5.png",
    "live": "https://lucali-frontend-rubayetseason.vercel.app/",
    "client": "https://github.com/rubayetseason/lucali/tree/main/lucali-frontend",
    "server": "https://github.com/rubayetseason/lucali/tree/main/lucali-backend"
  },
  {
    "id": 4,
    "name": "Motohub",
    "project_info": "A Virtual Garage for Used Bikes",
    "image": "./projectimg/preview-1.png",
    "short_detail": "This is a React project for used motorbike buying and selling. Buyers can buy/wishlist their desired bikes here and complete the payment, whereas sellers can post their bikes and checkout their buyers. Lastly, admins can check all the buyers, sellers and their acitivites.",
    "detail": "This is a fully authenticated and authorized website created with ReactJS. The homepage shows all the advertized bikes as well as a catagory based bike section. The products page is used to check all the available bikes data fetched from the dedicated database. Buyers can pay for their products with card method, while the sellers can post their new products to the website. The admin can check on all the activities of the buyers and sellers and delete one if necessary. The entire project created with the help of Tailwind CSS gives it the aestheticness it needs to complete it as a full-stack website.",
    "slide1": "./projectimg/moto-1.png",
    "slide2": "./projectimg/moto-2.png",
    "slide3": "./projectimg/moto-3.png",
    "live": "https://motohub-35078.web.app/",
    "client": "https://github.com/rubayetseason/motohub-client",
    "server": "https://github.com/rubayetseason/motohub-server"
  },
  {
    "id": 2,
    "name": "Mengary",
    "project_info": "An E-commerce Website",
    "image": "./projectimg/preview-5.png",
    "short_detail": "This is a React project for an E-commerce site where user can buy their desired products. Buyers can buy here through adding those items in the cart and complete the payment for their products.",
    "detail": "This is a full-stack React website styled with Tailwind CSS and DaisyUI component library. The user customers can add their desired product to the cart. Through the cart, the user can complete their payment through Stripe payment method or they can either add more items to the cart. A dedicated MongoDB database is used for the server side to fetch the data and Context API with the help of CRUD operation is usedfor the cart functionality.",
    "slide1": "./projectimg/e1.png",
    "slide2": "./projectimg/e2.png",
    "slide3": "./projectimg/e3.png",
    "live": "https://mengary.netlify.app",
    "client": "https://github.com/rubayetseason/mengary-client",
    "server": "https://github.com/rubayetseason/mengary-server"
  },
  {
    "id": 1,
    "name": "Nitflex",
    "project_info": "A Netflix Clone",
    "image": "./projectimg/preview-2.png",
    "short_detail": "This is a React Project, as by the title says, a Netflix Clone, where users can checkout their desired movies and series trailer by clicking the poster.",
    "detail": "As a Netflix clone, this website has almost all the features and functionalities of that of Netflix. Although this is only a client side website with no server side, thus all the movie data here are fetched from the TMDB database API. This website uses Tailwind CSS for styling and Firebase for authentication. react-youtube and react-trailer packages are used to show the trailer when a poster is clicked",
    "slide1": "./projectimg/net-1.png",
    "slide2": "./projectimg/net-2.png",
    "slide3": "./projectimg/net-3.png",
    "live": "https://netflix-clone-client-f7fec.web.app/",
    "client": "https://github.com/rubayetseason/netflix-clone-client",
    "server": ""
  },
  {
    "id": 5,
    "name": "Quiz Master",
    "project_info": "A Quiz Taking Application",
    "image": "./projectimg/preview-4.png",
    "short_detail": "This is a quiz taking React application where the user can judge their programming knowledge based on the quiz topics we have. The correct answer will throw a success toast, contrastingly, a wrong answer will throw an error toast.",
    "detail": "With the help of the quiz questions in this React application, users may assess their level of programming expertise. A successful toast will be thrown if the response is accurate, whereas an error toast will be thrown if the answer is incorrect. The entire site is styled with Tailwind. The statistics section will show a simple line graph created from recharts.",
    "slide1": "./projectimg/quiz1.png",
    "slide2": "./projectimg/quiz2.png",
    "slide3": "./projectimg/quiz3.png",
    "live": "https://cheery-cajeta-dc4a7e.netlify.app",
    "client": "https://github.com/rubayetseason/quiz-master",
    "server": ""
  }
]
